using static System.Console;

namespace HomeWork12Game
{
    internal class Hospital
    {
        public void InHospital()
        {
            WriteLine("\nОчнувшись в госпитале, Чудаков увидел своего лаборанта. Того самого, чей отчет он читал, перед тем как случилось все это.\n");
            WriteLine("- Как Вы себя чувствуете, профессор?, - спросил лаборант, увидев, что Чудаков пришел в себя\n");
            WriteLine("- Приемлемо, - ответил профессор слабым голосом, - Где я?\n");
            WriteLine("- Вы в больнице, - сообщил лаборант. - Вы проспали 70 часов после того, как Вас привезли, всего в крови и без сознания. Врачи говорили, что Вы можете впасть в кому. Что там произошло?\n");
            WriteLine("- Если решишь, что я спятил, я не обижусь, - сказал Чудаков и рассказал парню свою историю.\n");
            WriteLine("- Я обязательно туда вернусь, - добавил он в конце, - Я обязан выяснить, что это было, иначе я до конца своих дней буду считать себя сумасшедшим.\n");
            WriteLine("- Я пойду с Вами, профессор, - сказал молодой лаборант, - я Вас больше туда не пущу.\n");
            WriteLine("Профессор посмотрел в решительные глаза лаборанта, кивнул, соглашаясь, и слабо улыбнулся.");
            WriteLine();
            WriteLine();
            WriteLine();
            WriteLine("Поздравляю!:)");
            Write("\nНажмите любую клавишу для завершения");
            ReadKey();
        }
    }
}
